app/controllers/tattoos_controller.rb

SELECT * FROM `tattoos`
---
  def index
    @tattoos = Tattoo.all

SELECT * FROM `tattoos` WHERE (`tattoos`.`id` = 1)
---
  def show
    @tattoo = Tattoo.find(params[:id])

SELECT * FROM `tattoos` WHERE (`tattoos`.`id` = 1)
---
  def edit
    @tattoo = Tattoo.find(params[:id])

INSERT INTO `tattoos` (`created_at`, `photo_file_size`, `title`, `updated_at`, `photo_file_name`, `photo_content_type`, `user_id`, `photo_updated_at`, `description`, `artist_id`) VALUES('2010-05-15 21:49:34', NULL, 'Father', '2010-05-15 21:49:34', NULL, NULL, NULL, NULL, 'Picture of Father', NULL)
---
  def create
    @tattoo = Tattoo.new(params[:tattoo])

    respond_to do |format|
      if @tattoo.save

SELECT * FROM `tattoos` WHERE (`tattoos`.`id` = 1)
UPDATE `tattoos` SET `updated_at` = '2010-05-15 20:19:46', `photo_file_name` = 'butterfly at Kamehameha Maui.jpg', `photo_updated_at` = '2010-05-15 20:19:46', `photo_file_size` = 75667, `photo_content_type` = 'image/jpeg' WHERE `id` = 1
---
  def update
    @tattoo = Tattoo.find(params[:id])

    respond_to do |format|
      if @tattoo.update_attributes(params[:tattoo])