app/controllers/users_controller.rb

SELECT * FROM `users` ORDER BY users.id DESC LIMIT 1
---
  def index
    @users = User.all

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `email`) VALUES('2010-05-15 21:12:48', 'f115d6af7141373def02038b7f01c3f4b8d87860d097e802cacb69919205e3ab5e0b090bbc7eb3dcfa6274e7b7f822e3c6899cc618ce76a41844ac48d4c01a9a', '2010-05-15 21:12:48', 'eric', 'IeJsOWjMoKMdTX-Uqvih', 'fe262aabb60dd0c40ecbed4f6592c1ac9101de24f9a37f223ffb05fae45812b5c9058378535fbac93f6524fe1e5cc90d700ae5df359968a1d629fc74f2ec21a7', 'eric@blackbook.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

UPDATE `users` SET `updated_at` = '2010-05-15 21:46:29', `crypted_password` = 'cc8586148a1be77d56b8a79dc321a6b9005cbc96627a07493065b0bca4eba74eeeada1d925428e02503cd5cd557209cb4bb895214541fbdd512ae519ec6239e9', `password_salt` = '84d4MpIvCvjv2KoQEbSv', `persistence_token` = 'f32c9eac6248076de9381113a18624975fd9f836a91d6d26ebca3a40824c82a44a1932d87f3dac2de84907c9229d000bee487fc709a38079882fb64b7506bb61' WHERE `id` = 1
---
  def update
    @user = current_user

    respond_to do |format|
      if @user.update_attributes(params[:user])